Autodesk.Revit.DB.Architecture.StairsNumberSystemReferenceOption
The reference types permitted for a number system to refer to the geometry of a stairs run.
Since:
2013

Autodesk.Revit.DB.Architecture.StairsNumberSystemReferenceOption.RightQuarter
The number system reference to right quarter of stairs

Autodesk.Revit.DB.Architecture.StairsNumberSystemReferenceOption.LeftQuarter
The number system reference to left quarter of stairs

Autodesk.Revit.DB.Architecture.StairsNumberSystemReferenceOption.Right
The number system reference to right boundary of stairs.

Autodesk.Revit.DB.Architecture.StairsNumberSystemReferenceOption.Left
The number system reference to left boundary of stairs.

Autodesk.Revit.DB.Architecture.StairsNumberSystemReferenceOption.Center
The number system reference to stairs path.